/* errAuthorizationInvalidSet */
"-60001" = "I diritti di autorizzazione non sono validi.";

/* errAuthorizationInvalidRef */
"-60002" = "Il riferimento all'autorizzazione non è valido.";

/* errAuthorizationInvalidTag */
"-60003" = "Il contrassegno dell'autorizzazione non è valido.";

/* errAuthorizationInvalidPointer */
"-60004" = "L'autorizzazione restituita non è valida.";

/* errAuthorizationDenied */
"-60005" = "È stata negata l’autorizzazione.";

/* errAuthorizationCanceled */
"-60006" = "L’autorizzazione è stata annullata dall’utente.";

/* errAuthorizationInteractionNotAllowed */
"-60007" = "È stata negata l’autorizzazione siccome non è stata possibile l’interazione dell’utente.";

/* errAuthorizationInternal */
"-60008" = "Impossibile ottenere l'autorizzazione per questa operazione.";

/* errAuthorizationExternalizeNotAllowed */
"-60009" = "Non è permesso che l'autorizzazione venga convertita in un formato esterno.";

/* errAuthorizationInternalizeNotAllowed */
"-60010" = "Non è permesso che l'autorizzazione venga creata da un formato esterno.";

/* errAuthorizationInvalidFlags */
"-60011" = "Il/i contrassegno/i di opzione fornito/i non è/sono valido/i per questa operazione di autorizzazione.";

/* errAuthorizationToolExecuteFailure */
"-60031" = "Impossibile eseguire il programma specificato";

/* errAuthorizationToolEnvironmentError */
"-60032" = "È stato ricevuto uno stato non valido durante l'esecuzione di uno strumento con privilegi.";

/* errAuthorizationBadAddress */
"-60033" = "L'indirizzo di porta richiesto non è valido (deve essere compreso nell'intervallo 0-1023 estremi inclusi).";

/* errSSLProtocol */
"-9800" = "errore protocollo SSL";

/* errSSLNegotiation */
"-9801" = "errore negoziazione Cipher Suite";

/* errSSLFatalAlert */
"-9802" = "Avviso grave";

/* errSSLWouldBlock */
"-9803" = "I/O potrebbero bloccare (non grave)";

/* errSSLSessionNotFound */
"-9804" = "tentativo di ripristino di una sessione sconosciuta";

/* errSSLClosedGraceful */
"-9805" = "connessione terminata bene";

/* errSSLClosedAbort */
"-9806" = "connessione terminata per un errore";

/* errSSLXCertChainInvalid */
"-9807" = "catena certificato non valida";

/* errSSLBadCert */
"-9808" = "formato certificato errato";

/* errSSLCrypto */
"-9809" = "errore crittografico sottostante";

/* errSSLInternal */
"-9810" = "errore interno";

/* errSSLModuleAttach */
"-9811" = "errore allegato modulo";

/* errSSLUnknownRootCert */
"-9812" = "catena certificato valida, root senza fiducia";

/* errSSLNoRootCert */
"-9813" = "catena certificato non verificata da root";

/* errSSLCertExpired */
"-9814" = "catena con certificato scaduto";

/* errSSLCertNotYetValid */
"-9815" = "catena con un certificato non ancora valido";

/* errSSLClosedNoNotify */
"-9816" = "il server ha chiuso la sessione senza avvisare";

/* errSSLBufferOverflow */
"-9817" = "memoria tampone fornita non sufficiente";

/* errSSLBadCipherSuite */
"-9818" = "SSLCipherSuite errato";

/* errSSLPeerUnexpectedMsg */
"-9819" = "ricevuto messaggio inatteso";

/* errSSLPeerBadRecordMac */
"-9820" = "MAC errato";

/* errSSLPeerDecryptionFail */
"-9821" = "decriptazione non riuscita";

/* errSSLPeerRecordOverflow */
"-9822" = "overflow registrazione";

/* errSSLPeerDecompressFail */
"-9823" = "decompressione fallita";

/* errSSLPeerHandshakeFail */
"-9824" = "handshake fallito";

/* errSSLPeerBadCert */
"-9825" = "certificato vario errato";

/* errSSLPeerUnsupportedCert */
"-9826" = "formato errato certificato non supportato";

/* errSSLPeerCertRevoked */
"-9827" = "certificato revocato";

/* errSSLPeerCertExpired */
"-9828" = "certificato scaduto";

/* errSSLPeerCertUnknown */
"-9829" = "certificato sconosciuto";

/* errSSLIllegalParam */
"-9830" = "parametro non valido";

/* errSSLPeerUnknownCA */
"-9831" = "Autorità Cert sconosciuta";

/* errSSLPeerAccessDenied */
"-9832" = "access denied";

/* errSSLPeerDecodeError */
"-9833" = "errore decodifica";

/* errSSLPeerDecryptError */
"-9834" = "errore decriptazione";

/* errSSLPeerExportRestriction */
"-9835" = "restrizione esportazione";

/* errSSLPeerProtocolVersion */
"-9836" = "versione protocollo errata";

/* errSSLPeerInsufficientSecurity */
"-9837" = "sicurezza non sufficiente";

/* errSSLPeerInternalError */
"-9838" = "errore interno";

/* errSSLPeerUserCancelled */
"-9839" = "Operazione annullata dall'utente";

/* errSSLPeerNoRenegotiation */
"-9840" = "rinegoziazione non concessa";

/* errSSLServerAuthCompleted */
"-9841" = "il certificato server è valido o è stato ignorato se la verifica è disabilitata";

/* errSSLClientCertRequested */
"-9842" = "il server ha richiesto un certificato client";

/* errSSLHostNameMismatch */
"-9843" = "mancata corrispondenza nome host peer";

/* errSSLConnectionRefused */
"-9844" = "peer ha fatto cadere la connessione prima di rispondere";

/* errSSLDecryptionFail */
"-9845" = "decriptazione fallita";

/* errSSLBadRecordMac */
"-9846" = "MAC errato";

/* errSSLRecordOverflow */
"-9847" = "overflow registrazione";

/* errSSLBadConfiguration */
"-9848" = "errore di configurazione";

/* errSecSuccess */
"0" = "Nessun errore.";

/* errSecUnimplemented */
"-4" = "Funzione o operazione non implementata.";

/* errSecParam */
"-50" = "Uno o più parametri passati a una funzione non sono validi.";

/* errSecAllocate */
"-108" = "Impossibile allocare memoria.";

/* errSecNotAvailable */
"-25291" = "Non è disponibile nessun portachiavi. È possibile che tu debba riavviare il computer.";

/* errSecReadOnly */
"-25292" = "Il portachiavi non può essere modificato.";

/* errSecAuthFailed */
"-25293" = "Il nome utente o la frase chiave inseriti non sono corretti.";

/* errSecNoSuchKeychain */
"-25294" = "Non posso trovare il portachiavi specificato.";

/* errSecInvalidKeychain */
"-25295" = "Il portachiavi specificato non è un documento portachiavi valido.";

/* errSecDuplicateKeychain */
"-25296" = "Esiste già un portachiavi con lo stesso nome.";

/* errSecDuplicateCallback */
"-25297" = "La funzione di risposta specificata è già installata.";

/* errSecInvalidCallback */
"-25298" = "La funzione di risposta specificata non è valida.";

/* errSecDuplicateItem */
"-25299" = "L’elemento specificato esiste già nel portachiavi.";

/* errSecItemNotFound */
"-25300" = "Impossibile trovare nel portachiavi l’elemento specificato.";

/* errSecBufferTooSmall */
"-25301" = "Non c’è memoria sufficiente per utilizzare l’elemento specificato.";

/* errSecDataTooLarge */
"-25302" = "Questo elemento contiene informazioni troppo estese oppure in un formato che non può essere visualizzato.";

/* errSecNoSuchAttr */
"-25303" = "L’attributo specificato non esiste.";

/* errSecInvalidItemRef */
"-25304" = "L’elemento specificato non è più valido. Potrebbe essere stato eliminato dal portachiavi.";

/* errSecInvalidSearchRef */
"-25305" = "Impossibile eseguire una ricerca nel portachiavi attuale.";

/* errSecNoSuchClass */
"-25306" = "L’elemento specificato sembrerebbe non essere un portachiavi valido.";

/* errSecNoDefaultKeychain */
"-25307" = "Non posso trovare un portachiavi di default.";

/* errSecInteractionNotAllowed */
"-25308" = "Non è consentita l’interazione dell’utente.";

/* errSecReadOnlyAttr */
"-25309" = "Non ho potuto modificare l’attributo specificato.";

/* errSecWrongSecVersion */
"-25310" = "Questo portachiavi è stato creato con un’altra versione del software di sistema e non può essere aperto.";

/* errSecKeySizeNotAllowed */
"-25311" = "Questo elemento specifica una dimensione della chiave troppo grande.";

/* errSecNoStorageModule */
"-25312" = "Non ho potuto caricare un componente richiesto (modulo di archiviazione dati). Potresti dover riavviare il computer.";

/* errSecNoCertificateModule */
"-25313" = "Non ho potuto caricare un componente richiesto (modulo del certificato). Potresti dover riavviare il computer.";

/* errSecNoPolicyModule */
"-25314" = "Non ho potuto caricare un componente richiesto (modulo della policy). Potresti dover riavviare il computer.";

/* errSecInteractionRequired */
"-25315" = "È richiesta l’interazione dell’utente, ma in questo momento non è consentita.";

/* errSecDataNotAvailable */
"-25316" = "Impossibile recuperare il contenuto di questo elemento.";

/* errSecDataNotModifiable */
"-25317" = "Impossibile modificare il contenuto di questo elemento.";

/* errSecCreateChainFailed */
"-25318" = "Non trovo uno o più certificati necessari per validare questo certificato.";

/* errSecInvalidPrefsDomain */
"-25319" = "Il dominio delle preferenze specificato non è valido.";

/* errSecACLNotSimple */
"-25240" = "L’elenco specificato per il controllo dell’accesso non ha una forma standard (semplice).";

/* errSecPolicyNotFound */
"-25241" = "Non ho trovato la policy specificata.";

/* errSecInvalidTrustSetting */
"-25242" = "L’impostazione specificata per la verifica della fiducia non è valida.";

/* errSecNoAccessForItem */
"-25243" = "L’elemento specificato non ha controllo d’accesso.";

/* errSecInvalidOwnerEdit */
"-25244" = "Tentativo non valido di modificare il proprietario di questo elemento.";

/* errSecTrustNotAvailable */
"-25245" = "Nessun risultato disponibile.";

/* errSecUnsupportedFormat */
"-25256" = "Formato di importazione/esportazione non supportato.";

/* errSecUnknownFormat */
"-25257" = "Formato sconosciuto per l’importazione.";

/* errSecKeyIsSensitive */
"-25258" = "Il materiale chiave deve essere protetto per l’esportazione.";

/* errSecMultiplePrivKeys */
"-25259" = "Si è cercato di importare chiavi private multiple.";

/* errSecPassphraseRequired */
"-25260" = "È necessaria una frase chiave per l’importazione/esportazione.";

/* errSecInvalidPasswordRef */
"-25261" = "Il riferimento password non era valido.";

/* errSecInvalidTrustSettings */
"-25262" = "Il registro delle impostazioni fiducia era corrotto.";

/* errSecNoTrustSettings */
"-25263" = "Nessuna impostazione fiducia trovata.";

/* errSecPkcs12VerifyFailure */
"-25264" = "Verifica MAC fallita durante importazione PKCS12.";

/* errSecDecode */
"-26275" = "Impossibile decodificare i dati forniti.";

/* CSSMERR_CSP_INVALID_DATA_COUNT */
"-2147415768" = "Valori errore CSP vettore dei buffer.";

/* CSSMERR_CSP_INVALID_CONTEXT */
"-2147415760" = "Valori errore CSP contesto crittografico.";

/* CSSMERR_CSP_STAGED_OPERATION_IN_PROGRESS */
"-2147415736" = "Valori errore API CSP crittografico gestito.";

/* CSSMERR_CSP_APPLE_PUBLIC_KEY_INCOMPLETE */
"-2147415039" = "* Si è tentato di utilizzare una chiave pubblica incompleta a causa della * mancanza di parametri relativi agli algoritmi.";

/* CSSMERR_CSP_APPLE_SIGNATURE_MISMATCH */
"-2147415038" = "corrispondenza firma codice fallita";

/* CSSMERR_CSP_APPLE_INVALID_KEY_START_DATE */
"-2147415037" = "Data inizio/data fine chiave non valida";

/* CSSMERR_CSPDL_APPLE_DL_CONVERSION_ERROR */
"-2147415035" = "Codici di errore per la sincronizzazione portachiavi";

/* CSSMERR_CSP_APPLE_SSLv2_ROLLBACK */
"-2147415034" = "Verifica padding SSLv2: attacco rollback rilevato";

/* CSSMERR_APPLEDL_INVALID_OPEN_PARAMETERS */
"-2147412992" = "L'argomento OpenParameters passato a CSSM_DL_DbCreate oppure a CSSM_DL_DbOpen non era NULL, né un puntatore a una struttura CSSM_APPLEDL_OPEN_PARAMETERS valida.";

/* CSSMERR_APPLEDL_DISK_FULL */
"-2147412991" = "un'operazione è fallita perché il disco era pieno";

/* CSSMERR_APPLEDL_QUOTA_EXCEEDED */
"-2147412990" = "operazione non riuscita per il superamento di una quota del disco";

/* CSSMERR_APPLEDL_FILE_TOO_BIG */
"-2147412989" = "un'operazione è fallita perché un documento è troppo grande";

/* CSSMERR_APPLEDL_INVALID_DATABASE_BLOB */
"-2147412988" = "le informazioni interne di uno o più database portachiavi non sono valide (\"blob\") ";

/* CSSMERR_APPLEDL_INCOMPATIBLE_DATABASE_BLOB */
"-2147412986" = "la versione del formato dei dati interni relativi alle informazioni interne del/dei database (\"blob\") non è valida";

/* CSSMERR_APPLETP_HOSTNAME_MISMATCH */
"-2147408896" = "Nome host non corrispondente";

/* CSSMERR_APPLETP_UNKNOWN_CRITICAL_EXTEN */
"-2147408895" = "Estensione incomprensibile con indicatore critico";

/* CSSMERR_APPLETP_NO_BASIC_CONSTRAINTS */
"-2147408894" = "Estensione di limiti base richiesta per norma, ma non presenta";

/* CSSMERR_APPLETP_INVALID_CA */
"-2147408893" = "BasicConstraints.CA non valide";

/* CSSMERR_APPLETP_INVALID_AUTHORITY_ID */
"-2147408892" = "ID chiave autorità illeggibile ";

/* CSSMERR_APPLETP_INVALID_SUBJECT_ID */
"-2147408891" = "ID chiave soggetto non valido ";

/* CSSMERR_APPLETP_INVALID_KEY_USAGE */
"-2147408890" = "Utilizzo chiave non valido per regole";

/* CSSMERR_APPLETP_INVALID_EXTENDED_KEY_USAGE */
"-2147408889" = "Utilizzo chiave estesa non valido per regole";

/* CSSMERR_APPLETP_INVALID_ID_LINKAGE */
"-2147408888" = "Connessione ID chiave soggetto/Autorità non valido";

/* CSSMERR_APPLETP_PATH_LEN_CONSTRAINT */
"-2147408887" = "PathLengthConstraint eccessiva";

/* CSSMERR_APPLETP_INVALID_ROOT */
"-2147408886" = "Gruppo certificato terminato in certificato root che non ha eseguito auto-verifica";

/* CSSMERR_APPLETP_CRL_EXPIRED */
"-2147408885" = "CRL scaduto/non valido ancora";

/* CSSMERR_APPLETP_CRL_NOT_FOUND */
"-2147408883" = "Impossibile trovare CRL adeguato";

/* CSSMERR_APPLETP_CRL_SERVER_DOWN */
"-2147408882" = "Il server CRL specificato non è in funzione";

/* CSSMERR_APPLETP_CRL_BAD_URI */
"-2147408881" = "URL punto di distribuzione CRL illeggibile";

/* CSSMERR_APPLETP_UNKNOWN_CERT_EXTEN */
"-2147408880" = "Certificato/estensione CRL sconosciuti critici";

/* CSSMERR_APPLETP_CRL_NOT_TRUSTED */
"-2147408878" = "CRL non verificabile per root";

/* CSSMERR_APPLETP_CRL_INVALID_ANCHOR_CERT */
"-2147408877" = "CRL verificato per root senza fiducia";

/* CSSMERR_APPLETP_CRL_POLICY_FAIL */
"-2147408876" = "Verifica politica CRL fallita";

/* CSSMERR_APPLETP_IDP_FAIL */
"-2147408875" = "Violazione estensione IssuingDistributionPoint";

/* CSSMERR_APPLETP_CERT_NOT_FOUND_FROM_ISSUER */
"-2147408874" = "Non trovo il certificato nell'issuerAltName specificato";

/* CSSMERR_APPLETP_BAD_CERT_FROM_ISSUER */
"-2147408873" = "Certificato non valido ottenuto da issuerAltName specificato";

/* CSSMERR_APPLETP_SMIME_EMAIL_ADDRS_NOT_FOUND */
"-2147408872" = "Indirizzo e-mail S/MIME non corrispondente";

/* CSSMERR_APPLETP_SMIME_BAD_EXT_KEY_USE */
"-2147408871" = "Impossibile trovare ExtendedKeyUsage S/MIME appropriato ";

/* CSSMERR_APPLETP_SMIME_BAD_KEY_USE */
"-2147408870" = "Incompatibilità KeyUsage S/MIME";

/* CSSMERR_APPLETP_SMIME_KEYUSAGE_NOT_CRITICAL */
"-2147408869" = "S/MIME, certificato con KeyUsage segnalato !critical";

/* CSSMERR_APPLETP_SMIME_NO_EMAIL_ADDRS */
"-2147408868" = "S/MIME, certificato utente con nome oggetto vuoto e nessun indirizzo email * in SubjectAltName";

/* CSSMERR_APPLETP_SMIME_SUBJ_ALT_NAME_NOT_CRIT */
"-2147408867" = "S/MIME, certificato utente con nome oggetto vuoto, SubjectAltName * non critico";

/* CSSMERR_APPLETP_SSL_BAD_EXT_KEY_USE */
"-2147408866" = "Utilizzo chiave estesa SSL adeguato non trovato";

/* CSSMERR_APPLETP_OCSP_BAD_RESPONSE */
"-2147408865" = "Nessuna corrispondenza con risposta OCSP";

/* CSSMERR_APPLETP_OCSP_BAD_REQUEST */
"-2147408864" = "Nessuna corrispondenza con richiesta OCSP";

/* CSSMERR_APPLETP_OCSP_UNAVAILABLE */
"-2147408863" = "Servizio OCSP non disponibile";

/* CSSMERR_APPLETP_OCSP_STATUS_UNRECOGNIZED */
"-2147408862" = "Status OCSP: certificato non riconosciuto";

/* CSSMERR_APPLETP_INCOMPLETE_REVOCATION_CHECK */
"-2147408861" = "controllo revoche fallito per ciascun certificato";

/* CSSMERR_APPLETP_NETWORK_FAILURE */
"-2147408860" = "errore network generale";

/* CSSMERR_APPLETP_OCSP_NOT_TRUSTED */
"-2147408859" = "Risposta OCSP non verificabile per principale o root";

/* CSSMERR_APPLETP_OCSP_INVALID_ANCHOR_CERT */
"-2147408858" = "Risposta OCSP verificata per root inaffidabile";

/* CSSMERR_APPLETP_OCSP_SIG_ERROR */
"-2147408857" = "Errore firma risposta OCSP";

/* CSSMERR_APPLETP_OCSP_NO_SIGNER */
"-2147408856" = "Nessun firmatario trovato per risposta OCSP";

/* CSSMERR_APPLETP_OCSP_RESP_MALFORMED_REQ */
"-2147408855" = "Stato risposta OCSP: richiesta non corretta";

/* CSSMERR_APPLETP_OCSP_RESP_INTERNAL_ERR */
"-2147408854" = "Stato risposta OCSP: errore interno";

/* CSSMERR_APPLETP_OCSP_RESP_TRY_LATER */
"-2147408853" = "Stato risposta OCSP: prova più tardi";

/* CSSMERR_APPLETP_OCSP_RESP_SIG_REQUIRED */
"-2147408852" = "Stato risposta OCSP: firma richiesta";

/* CSSMERR_APPLETP_OCSP_RESP_UNAUTHORIZED */
"-2147408851" = "Stato risposta OCSP: non autorizzato";

/* CSSMERR_APPLETP_OCSP_NONCE_MISMATCH */
"-2147408850" = "Risposta OCSP per il momento non coincide con richiesta";

/* CSSMERR_APPLETP_CS_BAD_CERT_CHAIN_LENGTH */
"-2147408849" = "Lunghezza catena certificato non valida per Firma codice";

/* CSSMERR_APPLETP_CS_NO_BASIC_CONSTRAINTS */
"-2147408848" = "Limiti base mancanti per Firma codice";

/* CSSMERR_APPLETP_CS_BAD_PATH_LENGTH */
"-2147408847" = "Limite lunghezza percorso non corretto per Firma codice";

/* CSSMERR_APPLETP_CS_NO_EXTENDED_KEY_USAGE */
"-2147408846" = "Utilizzo chiave estesa mancante per Firma codice";

/* CSSMERR_APPLETP_CODE_SIGN_DEVELOPMENT */
"-2147408845" = "Rilevato certificato firma codice stile sviluppo";

/* CSSMERR_APPLETP_RS_BAD_CERT_CHAIN_LENGTH */
"-2147408844" = "Lunghezza catena certificato non valida per Firma risorsa";

/* CSSMERR_APPLETP_RS_BAD_EXTENDED_KEY_USAGE */
"-2147408843" = "Utilizzo chiave estesa non corretto per Firma risorsa";

/* CSSMERR_APPLETP_TRUST_SETTING_DENY */
"-2147408842" = "Impostazioni fiducia: non consentire";

/* CSSMERR_APPLETP_INVALID_EMPTY_SUBJECT */
"-2147408841" = "NomeOggetto vuoto non valido";

/* CSSMERR_APPLETP_UNKNOWN_QUAL_CERT_STATEMENT */
"-2147408840" = "ID dichiarazione qualificata del certificato critico sconosciuto";

/* CSSMERR_APPLE_DOTMAC_REQ_QUEUED */
"-2147408796" = "richiesta certificato in coda";

/* CSSMERR_APPLE_DOTMAC_REQ_REDIRECT */
"-2147408795" = "richiesta certificato ridiretta";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ERR */
"-2147408794" = "errore generale comunicato dal server";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_PARAM */
"-2147408793" = "errore parametro comunicato dal server";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_AUTH */
"-2147408792" = "errore autorizzazione comunicato dal server";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_UNIMPL */
"-2147408791" = "comunicato dal server non implementato";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_NOT_AVAIL */
"-2147408790" = "comunicato dal server non disponibile";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_ALREADY_EXIST */
"-2147408789" = "Esiste già comunicato dal server";

/* CSSMERR_APPLE_DOTMAC_REQ_SERVER_SERVICE_ERROR */
"-2147408788" = "errore di servizio comunicato dal server";

/* CSSMERR_APPLE_DOTMAC_REQ_IS_PENDING */
"-2147408787" = "richiesta in attesa per l'utente specificato";

/* CSSMERR_APPLE_DOTMAC_NO_REQ_PENDING */
"-2147408786" = "nessuna richiesta in sospeso per l'utente specificato";

/* CSSMERR_APPLE_DOTMAC_CSR_VERIFY_FAIL */
"-2147408785" = "Verifica non eseguita da CSR";

/* CSSMERR_APPLE_DOTMAC_FAILED_CONSISTENCY_CHECK */
"-2147408784" = "il server ha segnalato una verifica della compatibilità non riuscita";

/* errSecCSUnimplemented */
"-67072" = "funzionalità firma codice non implementata";

/* errSecCSInvalidObjectRef */
"-67071" = "riferimento oggetto API non valido";

/* errSecCSInvalidFlags */
"-67070" = "indicatore/i API specificato/i inappropriato/i o non valido/i";

/* errSecCSObjectRequired */
"-67069" = "l'argomento puntatore richiesto era NULL";

/* errSecCSStaticCodeNotFound */
"-67068" = "impossibile trovare oggetto codice su disco";

/* errSecCSUnsupportedGuestAttributes */
"-67067" = "impossibile individuare ospiti con set attributo";

/* errSecCSInvalidAttributeValues */
"-67066" = "valori attributo dati non validi";

/* errSecCSNoSuchCode */
"-67065" = "l'host non ha un ospite con gli attributi richiesti";

/* errSecCSMultipleGuests */
"-67064" = "host ha ospiti multipli con questo valore attributo";

/* errSecCSGuestInvalid */
"-67063" = "identità del codice non valida";

/* errSecCSUnsigned */
"-67062" = "oggetto del codice non firmato";

/* errSecCSSignatureFailed */
"-67061" = "codice o firma modificati";

/* errSecCSSignatureNotVerifiable */
"-67060" = "impossibile leggere la firma, ad esempio a causa di un documento di sistema che devia la root verso un utente senza privilegi";

/* errSecCSSignatureUnsupported */
"-67059" = "tipo o versione di firma non supportati";

/* errSecCSBadDictionaryFormat */
"-67058" = "Un documento plist o risorsa richiesti non conformi";

/* errSecCSResourcesNotSealed */
"-67057" = "risorse non sigillate da firma";

/* errSecCSResourcesNotFound */
"-67056" = "Impossibile trovare risorsa sigillata nel codice";

/* errSecCSResourcesInvalid */
"-67055" = "la directory della risorsa sigillata non è valida";

/* errSecCSBadResource */
"-67054" = "una risorsa sigillata è mancante o non valida";

/* errSecCSResourceRulesInvalid */
"-67053" = "regola/e di selezione risorsa non valida/e";

/* errSecCSReqInvalid */
"-67052" = "requisito(i) codice non validi o corrotti";

/* errSecCSReqUnsupported */
"-67051" = "versione o tipo non supportati requisito(i) codice ";

/* errSecCSReqFailed */
"-67050" = "soddisfazione requisito(i) codice fallita";

/* errSecCSBadObjectFormat */
"-67049" = "formato documento oggetto non valido o non adeguato";

/* errSecCSInternalError */
"-67048" = "errore interno del sottosistema firma codice";

/* errSecCSHostReject */
"-67047" = "il codice ha rifiutato il proprio host";

/* errSecCSNotAHost */
"-67046" = "questo codice non è un host";

/* errSecCSSignatureInvalid */
"-67045" = "formato non valido per la firma";

/* errSecCSHostProtocolRelativePath */
"-67044" = "violazione del protocollo host: richiesto percorso assoluto ospite";

/* errSecCSHostProtocolContradiction */
"-67043" = "violazione del protocollo host: modalità di hosting contraddittorie";

/* errSecCSHostProtocolDedicationError */
"-67042" = "violazione del protocollo host: operazione non consentita con/per un ospite dedicato";

/* errSecCSHostProtocolNotProxy */
"-67041" = "violazione del protocollo host: hosting del proxy non attivato";

/* errSecCSHostProtocolStateError */
"-67040" = "violazione del protocollo host: richiesta di modifica di stato dell'ospite non valida";

/* errSecCSHostProtocolUnrelated */
"-67039" = "violazione del protocollo host: l'ospite non appartiene a questo host";

/* errSecCSInvalidOperation */
"-67038" = "operazione richiesta non valida";

/* errSecCSNotSupported */
"-67037" = "operazione non supportata per questo tipo di codice";

/* errSecCSCMSTooLarge */
"-67036" = "firma troppo grande per essere incorporata";

/* errSecCSHostProtocolInvalidHash */
"-67035" = "violazione del protocollo host - hash dell'ospite non valida";

/* errSecCSStaticCodeChanged */
"-67034" = "il programma sul disco non corrisponde a quello in esecuzione";

/* errSecCSSigDBDenied */
"-67033" = "accesso al database delle firme negato";

/* errSecCSSigDBAccess */
"-67032" = "impossibile accedere al database delle firme";

/* errSecCSHostProtocolInvalidAttribute */
"-67031" = "l'host ha restituito gli attributi dell'ospite non validi o inconsistenti";

/* errSecMisc_dskFulErr */
"-34" = "Il disco è pieno.";

/* errSecMisc_nsvErr */
"-35" = "Impossibile trovare il disco. È probabile che sia stato espulso.";

/* errSecMisc_bdNamErr */
"-37" = "Ho provato ad aprire un documento il cui nome contiene un carattere non valido.";

/* errSecMisc_fnfErr */
"-43" = "Non trovo il documento.";

/* errSecMisc_wPrErr */
"-44" = "Il disco è protetto in scrittura.";

/* errSecMisc_fLckdErr */
"-45" = "Il documento è protetto.";

/* errSecMisc_vLckdErr */
"-46" = "Il volume è protetto.";

/* errSecMisc_fBsyErr */
"-47" = "Il documento non è disponibile. Potrebbe essere in uso in un’altra applicazione.";

/* errSecMisc_dupFNErr */
"-48" = "Esiste già un documento con lo stesso nome.";

/* errSecMisc_opWrErr */
"-49" = "Il documento è già aperto con privilegi di scrittura.";

/* errSecMisc_volOffLinErr */
"-53" = "Il volume non è più disponibile. Potrebbe essere stato espulso.";

/* errSecMisc_permErr */
"-54" = "Non posso aprire il documento. Potrebbe essere in uso in un’altra applicazione.";

/* errSecMisc_extFSErr */
"-58" = "È possibile che questo volume non sia compatibile.";

/* errSecMisc_wrPermErr */
"-61" = "Non ho potuto modificare il documento. Potrebbe essere stato aperto senza i privilegi di accesso necessari.";

/* errSecMisc_offLinErr */
"-65" = "Il dispositivo di memoria non è più disponibile. Potrebbe essere stato espulso.";

/* errSecMisc_dirNFErr */
"-120" = "Impossibile trovare la directory.";

/* errSecMisc_volGoneErr */
"-124" = "Il volume del server non è più disponibile. Potrebbe essere stato disconnesso.";

/* errSecMisc_userCanceledErr */
"-128" = "Questa operazione è stata annullata dall'utente.";

/* errSecMisc_resNotFound */
"-192" = "Non ho trovato una risorsa necessaria.";

/* errSecMisc_resFNotFound */
"-193" = "Una risorsa necessaria è assente o danneggiata.";

/* errSecMisc_icNoURLErr */
"-673" = "La posizione specificata (URL) è di un tipo sconosciuto, oppure non contiene le informazioni sufficienti.";

/* errSecMisc_icConfigNotFoundErr */
"-674" = "Non ho potuto trovare un’applicazione di supporto per aprire l’URL specificato.";

/* errSecMisc_cantGetFlavorErr */
"-1854" = "La posizione (URL) di questo elemento è assente, oppure è stata formattata impropriamente.";

/* errSecMisc_afpAccessDenied */
"-5000" = "È stato negato l’accesso a questo elemento.";

/* errSecMisc_afpUserNotAuth */
"-5023" = "Autenticazione fallita. La password per questo server potrebbe essere stata cambiata dopo aver aggiunto l'elemento al portachiavi.";

